zephyrproject-rtos/zephyr/drivers/usb/udc/udc_stm32.c
/*
 * SPDX-FileCopyrightText: Copyright (c) 2023 Linaro Limited
 * SPDX-FileCopyrightText: Copyright (c) 2026 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file  udc_stm32.c
 * @brief STM32 USB device controller (UDC) driver
 */

#include <soc.h>
#include <stm32cube_hal.h>
#include <stm32_ll_bus.h>
#include <stm32_ll_pwr.h>
#include <stm32_ll_rcc.h>
#include <stm32_ll_system.h>
#include <string.h>
#include <zephyr/irq.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/sys/util.h>

#include "udc_common.h"
#include <stm32_usb_common.h>

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(udc_stm32, CONFIG_UDC_DRIVER_LOG_LEVEL);


#ifdef CONFIG_STM32_HAL2
typedef hal_pcd_handle_t		stm32_pcd_handle_t;

#define STM32_PCD_DRD_FS		HAL_PCD_DRD_FS
#define STM32_PCD_EP_TYPE_CTRL		HAL_PCD_EP_TYPE_CTRL
#define STM32_PCD_EP_TYPE_ISOC		HAL_PCD_EP_TYPE_ISOC
#define STM32_PCD_EP_TYPE_BULK		HAL_PCD_EP_TYPE_BULK
#define STM32_PCD_EP_TYPE_INTR		HAL_PCD_EP_TYPE_INTR
#define STM32_PCD_SNG_BUF		HAL_PCD_SNG_BUF
#define STM32_PCD_DBL_BUF		HAL_PCD_DBL_BUF
#define STM32_PCD_SPEED_FS		HAL_PCD_SPEED_FS
#define STM32_PCD_PHY_EXTERNAL_ULPI	HAL_PCD_PHY_EXTERNAL_ULPI
#define STM32_PCD_PHY_EMBEDDED_FS	HAL_PCD_PHY_EMBEDDED_FS
#define STM32_PCD_PHY_EMBEDDED_HS	HAL_PCD_PHY_EMBEDDED_HS
#else /* CONFIG_STM32_HAL2 */
typedef PCD_HandleTypeDef		stm32_pcd_handle_t;

#ifdef USB_DRD_FS
#define STM32_PCD_DRD_FS		USB_DRD_FS
#endif /* USB_DRD_FS */
#define STM32_PCD_EP_TYPE_CTRL		EP_TYPE_CTRL
#define STM32_PCD_EP_TYPE_ISOC		EP_TYPE_ISOC
#define STM32_PCD_EP_TYPE_BULK		EP_TYPE_BULK
#define STM32_PCD_EP_TYPE_INTR		EP_TYPE_INTR
#ifdef PCD_SNG_BUF
#define STM32_PCD_SNG_BUF		PCD_SNG_BUF
#define STM32_PCD_DBL_BUF		PCD_DBL_BUF
#endif /* PCD_SNG_BUF */
#define STM32_PCD_SPEED_FS		PCD_SPEED_FULL
#define STM32_PCD_PHY_EXTERNAL_ULPI	PCD_PHY_ULPI
#define STM32_PCD_PHY_EMBEDDED_FS	PCD_PHY_EMBEDDED
#define STM32_PCD_PHY_EMBEDDED_HS	PCD_PHY_UTMI
#endif /* CONFIG_STM32_HAL2 */

/*
 * The STM32 HAL does not provide PCD_SPEED_HIGH and PCD_SPEED_HIGH_IN_FULL
 * on series which lack HS-capable hardware. Provide dummy definitions for
 * these series to remove checks elsewhere in the driver. The exact value
 * of the dummy definitions in insignificant, as long as they are not equal
 * to PCD_SPEED_FULL (which is always provided).
 */
#if !defined(PCD_SPEED_HIGH)
#define PCD_SPEED_HIGH		(STM32_PCD_SPEED_FS + 1)
#define PCD_SPEED_HIGH_IN_FULL	(PCD_SPEED_HIGH + 1)
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_otghs)
#define DT_DRV_COMPAT st_stm32_otghs
#define UDC_STM32_IRQ_NAME     otghs
#elif DT_HAS_COMPAT_STATUS_OKAY(st_stm32_otgfs)
#define DT_DRV_COMPAT st_stm32_otgfs
#define UDC_STM32_IRQ_NAME     otgfs
#elif DT_HAS_COMPAT_STATUS_OKAY(st_stm32_usb)
#define DT_DRV_COMPAT st_stm32_usb
#define UDC_STM32_IRQ_NAME     usb
#endif

/*
 * Returns the 'PCD_PHY_Module' value for 'usb_node', which
 * corresponds to the PHY interface that should be used by
 * the USB controller.
 *
 * This value may be one of:
 *    - STM32_PCD_PHY_EMBEDDED_FS: embedded Full-Speed PHY
 *    - STM32_PCD_PHY_EMBEDDED_HS: embedded High-Speed PHY over UTMI+
 *    - STM32_PCD_PHY_EXTERNAL_ULPI: external High-Speed PHY over ULPI
 *
 * The correct value is always STM32_PCD_PHY_EMBEDDED_FS for nodes
 * that are not HS-capable: these instances are always
 * hardwired to an embedded FS PHY.
 *
 * The correct value for HS-capable nodes is determined from
 * the 'compatible' list on the PHY DT node, which is referenced
 * by the USB controller's 'phys' property:
 *  - External HS PHYs must have 'usb-ulpi-phy' compatible
 *  - Embedded HS PHYs must have one of the ST-specific compatibles
 *  - Others ('usb-nop-xceiv') are assumed to be embedded FS PHYs
 */
#define UDC_STM32_NODE_PHY_ITFACE(usb_node)					\
	COND_CASE_1(								\
		USB_STM32_NODE_PHY_IS_ULPI(usb_node),				\
			(STM32_PCD_PHY_EXTERNAL_ULPI),				\
		USB_STM32_NODE_PHY_IS_EMBEDDED_HS(usb_node),			\
			(STM32_PCD_PHY_EMBEDDED_HS),				\
		(STM32_PCD_PHY_EMBEDDED_FS))

/*
 * Evaluates to 1 if 'usb_node' uses an embedded FS PHY or has
 * the 'maximum-speed' property set to 'full-speed', 0 otherwise.
 */
#define UDC_STM32_NODE_LIMITED_TO_FS(usb_node)					\
	UTIL_OR(IS_EQ(UDC_STM32_NODE_PHY_ITFACE(usb_node), PHY_PCD_EMBEDDED),	\
		UTIL_AND(DT_NODE_HAS_PROP(usb_node, maximum_speed),		\
			DT_ENUM_HAS_VALUE(usb_node, maximum_speed, full_speed)))

/*
 * Returns the 'PCD_Speed' value for 'usb_node', which indicates
 * the operation mode in which controller should be configured.
 *
 * The 'maximum-speed' property is taken into account but only when
 * present on an HS-capable instance to force 'full-speed' mode; all
 * other uses are invalid and silently ignored.
 */
#define UDC_STM32_NODE_SPEED(usb_node)					\
	COND_CODE_0(USB_STM32_NODE_IS_HS_CAPABLE(usb_node),		\
		(STM32_PCD_SPEED_FS),					\
	(COND_CODE_1(UDC_STM32_NODE_LIMITED_TO_FS(usb_node),		\
		(PCD_SPEED_HIGH_IN_FULL),				\
		(PCD_SPEED_HIGH))))

/*
 * Returns max packet size allowed for endpoints of 'usb_node'
 *
 * Hardware always supports the maximal value allowed
 * by the USB Specification at a given operating speed:
 * 1024 bytes in High-Speed, 1023 bytes in Full-Speed
 */
#define UDC_STM32_NODE_EP_MPS(node_id)					\
	((UDC_STM32_NODE_SPEED(node_id) == PCD_SPEED_HIGH) ? 1024U : 1023U)


/*
 * Hardcode EP0 max packet size (bMaxPacketSize0) to 64,
 * which is the maximum allowed by the USB Specification
 * and supported by all STM32 USB controllers.
 */
#define UDC_STM32_EP0_MAX_PACKET_SIZE	64U

enum udc_stm32_msg_type {
	UDC_STM32_MSG_SETUP,
	UDC_STM32_MSG_DATA_OUT,
	UDC_STM32_MSG_DATA_IN,
};

struct udc_stm32_msg {
	uint8_t type;
	uint8_t ep;
	uint16_t rx_count;
};

struct udc_stm32_data  {
	stm32_pcd_handle_t pcd;
	const struct device *dev;
	uint32_t occupied_mem;
	/* wLength of SETUP packet for s-out-status */
	uint32_t ep0_out_wlength;
	struct k_thread thread_data;
	struct k_msgq msgq_data;
	char msgq_buf[CONFIG_UDC_STM32_MAX_QMESSAGES * sizeof(struct udc_stm32_msg)];
};

struct udc_stm32_config {
	/* Controller MMIO base address */
	void *base;
	/* # of bidirectional endpoints supported */
	uint32_t num_endpoints;
	/* USB SRAM size (in bytes) */
	uint32_t dram_size;
	/* IRQ_CONNECT() per-instance wrapper */
	void (*irq_connect)(void);
	/* Global USB interrupt IRQn */
	uint32_t irqn;
	/*
	 * Clock configuration from DTS
	 *
	 * Note that this actually points to a const
	 * struct stm32_pclken but dropping the const
	 * qualifier here allows calling Clock Control
	 * without cast to clock_control_subsys_t.
	 */
	struct stm32_pclken *pclken;
	/* Pinctrl configuration from DTS */
	const struct pinctrl_dev_config *pinctrl;
	/* USB PHY pseudo-device */
	const struct stm32_usb_phy *phy;
	/* Disconnect GPIO information (if applicable) */
	const struct gpio_dt_spec disconnect_gpio;
	/* ULPI reset GPIO information (if applicable) */
	const struct gpio_dt_spec ulpi_reset_gpio;
	/* PHY selected for use by instance */
	uint32_t selected_phy;
	/* Speed selected for use by instance */
	uint32_t selected_speed;
	/* EP configurations */
	struct udc_ep_config *in_eps;
	struct udc_ep_config *out_eps;
	/* Worker thread stack info */
	k_thread_stack_t *thread_stack;
	size_t thread_stack_size;
	/* Maximal packet size allowed for endpoints */
	uint16_t ep_mps;
	/* Number of entries in `pclken` */
	uint8_t num_clocks;
};

#define hpcd2data(hpcd) CONTAINER_OF(hpcd, struct udc_stm32_data, pcd)

static stm32_status_t hal_udc_open_endpoint(stm32_pcd_handle_t *hpcd, uint8_t ep_addr,
					    uint16_t ep_mps, uint8_t ep_type)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_OpenEndpoint(hpcd, ep_addr, ep_mps, ep_type);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_EP_Open(hpcd, ep_addr, ep_mps, ep_type);
#endif /* CONFIG_STM32_HAL2 */
}

static stm32_status_t hal_udc_close_endpoint(stm32_pcd_handle_t *hpcd, uint8_t ep_addr)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_CloseEndpoint(hpcd, ep_addr);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_EP_Close(hpcd, ep_addr);
#endif /* CONFIG_STM32_HAL2 */
}

static stm32_status_t hal_udc_set_endpoint_transmit(stm32_pcd_handle_t *hpcd, uint8_t ep_addr,
						    uint8_t *p_buffer, uint32_t size_byte)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_SetEndpointTransmit(hpcd, ep_addr, p_buffer, size_byte);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_EP_Transmit(hpcd, ep_addr, p_buffer, size_byte);
#endif /* CONFIG_STM32_HAL2 */
}

