zephyrproject-rtos/zephyr/drivers/usb/udc/udc_stm32.c
static stm32_status_t hal_udc_set_endpoint_receive(stm32_pcd_handle_t *hpcd, uint8_t ep_addr,
						   uint8_t *p_buffer, uint32_t size_byte)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_SetEndpointReceive(hpcd, ep_addr, p_buffer, size_byte);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_EP_Receive(hpcd, ep_addr, p_buffer, size_byte);
#endif /* CONFIG_STM32_HAL2 */
}

#if defined(USB) || defined(STM32_PCD_DRD_FS)
static stm32_status_t hal_udc_pma_config(stm32_pcd_handle_t *hpcd, uint16_t ep_addr,
					 uint16_t ep_kind, uint32_t pma_address)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_PMAConfig(hpcd, ep_addr, ep_kind, pma_address);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCDEx_PMAConfig(hpcd, ep_addr, ep_kind, pma_address);
#endif /* CONFIG_STM32_HAL2 */
}
#endif /* USB || STM32_PCD_DRD_FS */

static stm32_status_t hal_udc_set_device_address(stm32_pcd_handle_t *hpcd, uint8_t address)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_SetDeviceAddress(hpcd, address);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_SetAddress(hpcd, address);
#endif /* CONFIG_STM32_HAL2 */
}

static stm32_status_t hal_udc_remote_wakeup_start(stm32_pcd_handle_t *hpcd)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_RemoteWakeup_Start(hpcd);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_ActivateRemoteWakeup(hpcd);
#endif /* CONFIG_STM32_HAL2 */
}

static stm32_status_t hal_udc_remote_wakeup_stop(stm32_pcd_handle_t *hpcd)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_RemoteWakeup_Stop(hpcd);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_DeActivateRemoteWakeup(hpcd);
#endif /* CONFIG_STM32_HAL2 */
}

static stm32_status_t hal_udc_set_endpoint_stall(stm32_pcd_handle_t *hpcd, uint8_t ep_addr)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_SetEndpointStall(hpcd, ep_addr);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_EP_SetStall(hpcd, ep_addr);
#endif /* CONFIG_STM32_HAL2 */
}

static stm32_status_t hal_udc_clear_endpoint_stall(stm32_pcd_handle_t *hpcd, uint8_t ep_addr)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_ClearEndpointStall(hpcd, ep_addr);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_EP_ClrStall(hpcd, ep_addr);
#endif /* CONFIG_STM32_HAL2 */
}

static stm32_status_t hal_udc_flush_endpoint(stm32_pcd_handle_t *hpcd, uint8_t ep_addr)
{
#ifdef CONFIG_STM32_HAL2
	return HAL_PCD_FlushEndpoint(hpcd, ep_addr);
#else /* CONFIG_STM32_HAL2 */
	return HAL_PCD_EP_Flush(hpcd, ep_addr);
#endif /* CONFIG_STM32_HAL2 */
}

/*
 * The callbacks below are invoked by HAL_PCD_IRQHandler() when appropriate.
 * HAL_PCD_IRQHandler() is registered as ISR for this driver because it just
 * so happens to match the Zephyr ISR calling convention, and we don't need
 * to do any additional processing upon interrupt: this saves a few cycles
 * when taking an interrupt and ought to consume less ROM too.
 *
 * (As an exception, the Setup/DataIn/DataOut callback are right above their
 *  ISR lower half/worker thread handler functions rather than grouped here)
 */
void HAL_PCD_ResetCallback(stm32_pcd_handle_t *hpcd)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);
	const struct device *dev = priv->dev;
	struct udc_ep_config *ep_cfg;
	stm32_status_t __maybe_unused status;

	/* Re-Enable control endpoints */
	ep_cfg = udc_get_ep_cfg(dev, USB_CONTROL_EP_OUT);
	if (ep_cfg != NULL && ep_cfg->stat.enabled) {
		status = hal_udc_open_endpoint(&priv->pcd, USB_CONTROL_EP_OUT,
					       UDC_STM32_EP0_MAX_PACKET_SIZE,
					       STM32_PCD_EP_TYPE_CTRL);
		__ASSERT_NO_MSG(status == HAL_OK);
	}

	ep_cfg = udc_get_ep_cfg(dev, USB_CONTROL_EP_IN);
	if (ep_cfg != NULL && ep_cfg->stat.enabled) {
		status = hal_udc_open_endpoint(&priv->pcd, USB_CONTROL_EP_IN,
					       UDC_STM32_EP0_MAX_PACKET_SIZE,
					       STM32_PCD_EP_TYPE_CTRL);
		__ASSERT_NO_MSG(status == HAL_OK);
	}

	udc_set_suspended(dev, false);
	udc_submit_event(priv->dev, UDC_EVT_RESET, 0);
}

void HAL_PCD_ConnectCallback(stm32_pcd_handle_t *hpcd)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);

	udc_submit_event(priv->dev, UDC_EVT_VBUS_READY, 0);
}

void HAL_PCD_DisconnectCallback(stm32_pcd_handle_t *hpcd)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);

	udc_submit_event(priv->dev, UDC_EVT_VBUS_REMOVED, 0);
}

void HAL_PCD_SuspendCallback(stm32_pcd_handle_t *hpcd)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);

	udc_set_suspended(priv->dev, true);
	udc_submit_event(priv->dev, UDC_EVT_SUSPEND, 0);
}

void HAL_PCD_ResumeCallback(stm32_pcd_handle_t *hpcd)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);

	udc_set_suspended(priv->dev, false);
	udc_submit_event(priv->dev, UDC_EVT_RESUME, 0);
}

void HAL_PCD_SOFCallback(stm32_pcd_handle_t *hpcd)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);

	udc_update_sof_stamp(priv->dev, 0);
	udc_submit_sof_event(priv->dev);
}

void HAL_PCD_ISOOUTIncompleteCallback(stm32_pcd_handle_t *hpcd, uint8_t epnum)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);
	uint8_t ep = epnum | USB_EP_DIR_OUT;
	struct udc_ep_config *ep_cfg;
	struct net_buf *buf;
	stm32_status_t status;

	ep_cfg = udc_get_ep_cfg(priv->dev, ep);
	if (ep_cfg == NULL) {
		return;
	}

	buf = udc_buf_peek(ep_cfg);
	if (buf == NULL) {
		return;
	}

	/* When an incomplete ISO OUT transfer occurs, the endpoint is disabled.
	 * Re-enable the endpoint to allow reception in the remaining free space
	 * of the buffer. HAL_PCD_DataOutStageCallback() will be called as usual
	 * when the buffer is eventually filled.
	 */
	status = hal_udc_set_endpoint_receive(&priv->pcd, ep, net_buf_tail(buf),
					      net_buf_tailroom(buf));
	if (status != HAL_OK) {
		LOG_ERR("ISO OUT re-enable failed(0x%02x), %d", ep, (int)status);
	}
}

void HAL_PCD_ISOINIncompleteCallback(stm32_pcd_handle_t *hpcd, uint8_t epnum)
{
	/* The OTG core aborts and disables the endpoint on IISOIXFR, then calls this
	 * instead of HAL_PCD_DataInStageCallback(). Drop the missed frame through the
	 * normal IN completion path so that the next queued buffer gets armed.
	 *
	 * The ST USB IP does not report incomplete isochronous IN transfers, so this
	 * callback is never invoked for it and HAL_PCD_DataInStageCallback() is called
	 * as usual.
	 */
	HAL_PCD_DataInStageCallback(hpcd, epnum);
}

void HAL_PCDEx_SetConnectionState(stm32_pcd_handle_t *hpcd, uint8_t state)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);
	const struct udc_stm32_config *cfg = priv->dev->config;

#if defined(CONFIG_SOC_SERIES_STM32L1X)
	/* On STM32L1 series, the USB D+ pull-up is controlled by software. */
	if (state) {
		LL_SYSCFG_EnableUSBPullUp();
	} else {
		LL_SYSCFG_DisableUSBPullUp();
	}
#endif /* CONFIG_SOC_SERIES_STM32L1X */

