zephyrproject-rtos/zephyr/drivers/usb/udc/udc_stm32.c
	if (cfg->disconnect_gpio.port != NULL) {
		gpio_pin_configure_dt(&cfg->disconnect_gpio,
				      state ? GPIO_OUTPUT_ACTIVE : GPIO_OUTPUT_INACTIVE);
	}
}

static int udc_stm32_tx(const struct device *dev, struct udc_ep_config *ep_cfg,
			struct net_buf *buf)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	stm32_status_t status;
	uint8_t *data;
	uint32_t len;

	LOG_DBG("TX ep 0x%02x len %u", ep_cfg->addr, buf->len);

	if (udc_ep_is_busy(ep_cfg)) {
		return 0;
	}

	data = buf->data;
	len = buf->len;

	if (ep_cfg->addr == USB_CONTROL_EP_IN) {
		len = MIN(UDC_STM32_EP0_MAX_PACKET_SIZE, buf->len);
	}

	buf->data += len;
	buf->len -= len;

	status = hal_udc_set_endpoint_transmit(&priv->pcd, ep_cfg->addr, data, len);
	if (status != HAL_OK) {
		LOG_ERR("hal_udc_set_endpoint_transmit failed(0x%02x), %d",
			ep_cfg->addr, (int)status);
		return -EIO;
	}

	udc_ep_set_busy(ep_cfg, true);

	return 0;
}

/* Start accepting packets (OUT transfers) */
static int udc_stm32_initiate_ep_rx(const struct device *dev,
				    struct udc_ep_config *const ep_cfg,
				    struct net_buf *const buf)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	stm32_status_t status;
	uint32_t rx_size;

	if (ep_cfg->addr == USB_CONTROL_EP_OUT) {
		struct udc_buf_info *bi = udc_get_buf_info(buf);

		if (bi->setup) {
			/* SETUP data will be received without any action */
			return 0;
		}
	}

	/*
	 * NOTE: we don't check udc_ep_is_busy(ep_cfg) here because
	 * this may be called while the endpoint is still *marked*
	 * as busy even though a transaction just ended. In such
	 * situation, the call to `udc_ep_set_busy(true)` at the
	 * end of this function is a no-op.
	 */

	LOG_DBG("RX ep 0x%02x len %u", ep_cfg->addr, buf->size);

	if (ep_cfg->addr == USB_CONTROL_EP_OUT) {
		/*
		 * Keep track of how much data we're expecting from
		 * host so we know when the transfer is complete.
		 * Unlike other endpoints, this bookkeeping isn't
		 * done by the HAL for OUT EP0.
		 */
		priv->ep0_out_wlength = buf->size;

		/* We can receive only up to bMaxPacketSize0 per
		 * call to HAL_PCD_EP_Receive(), regardless of
		 * how much data the host wants to send in total.
		 */
		rx_size = MIN(buf->size, UDC_STM32_EP0_MAX_PACKET_SIZE);
	} else {
		/* One call to HAL_PCD_EP_Receive() is enough,
		 * the HAL will split in multiple receive transfers
		 * and perform all bookkeeping internally.
		 */
		rx_size = buf->size;
	}

	status = hal_udc_set_endpoint_receive(&priv->pcd, ep_cfg->addr, buf->data, rx_size);
	if (status != HAL_OK) {
		LOG_ERR("hal_udc_set_endpoint_receive failed(0x%02x), %d",
			ep_cfg->addr, (int)status);
		return -EIO;
	}

	/* RX started - mark endpoint as busy */
	udc_ep_set_busy(ep_cfg, true);

	return 0;
}


static int udc_stm32_clock_enable(const struct device *dev)
{
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct udc_stm32_config *cfg = dev->config;
	int err;

	if (cfg->num_clocks > 1) {
		if (clock_control_configure(clk, &cfg->pclken[1], NULL) != 0) {
			LOG_ERR("Could not select USB domain clock");
			return -EIO;
		}
	}

	if (clock_control_on(clk, &cfg->pclken[0]) != 0) {
		LOG_ERR("Unable to enable USB clock");
		return -EIO;
	}

	if (IS_ENABLED(CONFIG_UDC_STM32_CLOCK_CHECK) && cfg->num_clocks > 1) {
		uint32_t usb_clock_rate;

		if (clock_control_get_rate(clk, &cfg->pclken[1], &usb_clock_rate) != 0) {
			LOG_ERR("Failed to get USB domain clock rate");
			return -EIO;
		}

		if (usb_clock_rate != MHZ(48)) {
			LOG_ERR("USB Clock is not 48MHz (%d)", usb_clock_rate);
			return -ENOTSUP;
		}
	}

	/* Previous check won't work in case of F1/F3. Add build time check */
#if defined(RCC_CFGR_OTGFSPRE) || defined(RCC_CFGR_USBPRE)

#if (MHZ(48) == CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC) && !defined(STM32_PLL_USBPRE)
	/* PLL output clock is set to 48MHz, it should not be divided */
#warning USBPRE/OTGFSPRE should be set in rcc node
#endif

#endif /* RCC_CFGR_OTGFSPRE / RCC_CFGR_USBPRE */

	/* Configure PHY if applicable (must be after enabling UDC clock) */
	if (cfg->phy != NULL) {
		err = cfg->phy->enable(cfg->phy);
		if (err != 0) {
			LOG_ERR("Failed to enable USB PHY: %d", err);
			return err;
		}
	}

	return 0;
}

static int udc_stm32_clock_disable(const struct device *dev)
{
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct udc_stm32_config *cfg = dev->config;
	int err;

	/* Per API contract, disable PHY before USB controller */
	if (cfg->phy != NULL) {
		err = cfg->phy->disable(cfg->phy);
		if (err != 0) {
			LOG_ERR("Failed to disable USB PHY: %d", err);
			return err;
		}
	}

	if (clock_control_off(clk, &cfg->pclken[0]) != 0) {
		LOG_ERR("Unable to disable USB clock");
		return -EIO;
	}

	return 0;
}

void HAL_PCD_DataOutStageCallback(stm32_pcd_handle_t *hpcd, uint8_t epnum)
{
	uint32_t rx_count = HAL_PCD_EP_GetRxCount(hpcd, epnum);
	struct udc_stm32_data *priv = hpcd2data(hpcd);
	struct udc_stm32_msg msg = {
		.type = UDC_STM32_MSG_DATA_OUT,
		.ep = epnum,
		.rx_count = rx_count,
	};
	int err;

	err = k_msgq_put(&priv->msgq_data, &msg, K_NO_WAIT);
	if (err != 0) {
		LOG_ERR("UDC Message queue overrun");
	}
}

static void handle_msg_data_out(struct udc_stm32_data *priv, uint8_t epnum, uint16_t rx_count)
{
	const struct device *dev = priv->dev;
	struct udc_ep_config *ep_cfg;
	uint8_t ep = epnum | USB_EP_DIR_OUT;
	struct net_buf *buf;

	LOG_DBG("DataOut ep 0x%02x",  ep);

	ep_cfg = udc_get_ep_cfg(dev, ep);

	buf = udc_buf_peek(ep_cfg);
	if (unlikely(buf == NULL)) {
		LOG_ERR("ep 0x%02x queue is empty", ep);
		udc_ep_set_busy(ep_cfg, false);
		return;
	}

	/* HAL copies data - we just need to update bookkeeping */
	net_buf_add(buf, rx_count);

	if (ep == USB_CONTROL_EP_OUT) {
		/* Verify that host did not send more data than it promised */
		__ASSERT(buf->len <= priv->ep0_out_wlength,
				"Received more data from Host than expected!");

		/* Check if the data stage is complete */
		if (rx_count == UDC_STM32_EP0_MAX_PACKET_SIZE &&
		    buf->len < priv->ep0_out_wlength) {
			stm32_status_t __maybe_unused status;
			uint32_t rx_size = MIN(net_buf_tailroom(buf),
					       UDC_STM32_EP0_MAX_PACKET_SIZE);

			/* Not yet - prepare to receive more data and wait */
			status = hal_udc_set_endpoint_receive(&priv->pcd, ep_cfg->addr,
							      net_buf_tail(buf), rx_size);
			__ASSERT_NO_MSG(status == HAL_OK);
			return;
		} /* else: buf->len == priv->ep0_out_wlength */
	}

	/* All data received - dequeue packet and submit it to stack */
	buf = udc_buf_get(ep_cfg);
	udc_submit_ep_event(dev, buf, 0);

	/* Prepare next transfer for EP if its queue is not empty */
	buf = udc_buf_peek(ep_cfg);
	if (buf != NULL) {
		udc_stm32_initiate_ep_rx(dev, ep_cfg, buf);
	} else { /* Nothing left to receive: EP is no longer busy */
		udc_ep_set_busy(ep_cfg, false);
	}
}

void HAL_PCD_DataInStageCallback(stm32_pcd_handle_t *hpcd, uint8_t epnum)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);
	struct udc_stm32_msg msg = {
		.type = UDC_STM32_MSG_DATA_IN,
		.ep = epnum,
	};
	int err;

