zephyrproject-rtos/zephyr/drivers/usb/udc/udc_stm32.c
	err = k_msgq_put(&priv->msgq_data, &msg, K_NO_WAIT);
	if (err != 0) {
		LOG_ERR("UDC Message queue overrun");
	}
}

static void handle_msg_data_in(struct udc_stm32_data *priv, uint8_t epnum)
{
	const struct device *dev = priv->dev;
	struct udc_ep_config *ep_cfg;
	uint8_t ep = epnum | USB_EP_DIR_IN;
	struct net_buf *buf;
	stm32_status_t status;

	LOG_DBG("DataIn ep 0x%02x",  ep);

	ep_cfg = udc_get_ep_cfg(dev, ep);
	udc_ep_set_busy(ep_cfg, false);

	buf = udc_buf_peek(ep_cfg);
	if (unlikely(buf == NULL)) {
		return;
	}

	if (ep == USB_CONTROL_EP_IN && buf->len > 0U) {
		uint32_t len = MIN(UDC_STM32_EP0_MAX_PACKET_SIZE, buf->len);

		status = hal_udc_set_endpoint_transmit(&priv->pcd, ep, buf->data, len);
		if (status != HAL_OK) {
			LOG_ERR("hal_udc_set_endpoint_transmit failed: %d", status);
			__ASSERT_NO_MSG(0);
			return;
		}

		buf->len -= len;
		buf->data += len;

		return;
	}

	if (udc_ep_buf_has_zlp(buf)) {
		udc_ep_buf_clear_zlp(buf);
		status = hal_udc_set_endpoint_transmit(&priv->pcd, ep, buf->data, 0);
		if (status != HAL_OK) {
			LOG_ERR("hal_udc_set_endpoint_transmit failed: %d", status);
			__ASSERT_NO_MSG(0);
		}

		return;
	}

	/* drop reference to packet and submit to stack */
	buf = udc_buf_get(ep_cfg);
	udc_submit_ep_event(dev, buf, 0);

	/* enqueue */
	buf = udc_buf_peek(ep_cfg);
	if (buf != NULL) {
		udc_stm32_tx(dev, ep_cfg, buf);
	}
}

void HAL_PCD_SetupStageCallback(stm32_pcd_handle_t *hpcd)
{
	struct udc_stm32_data *priv = hpcd2data(hpcd);
	struct udc_stm32_msg msg = {.type = UDC_STM32_MSG_SETUP};
	int err;

	err = k_msgq_put(&priv->msgq_data, &msg, K_NO_WAIT);

	if (err < 0) {
		LOG_ERR("UDC Message queue overrun");
	}
}

static void udc_stm32_thread_handler(void *arg1, void *arg2, void *arg3)
{
	const struct device *dev = arg1;
	struct udc_stm32_data *priv = udc_get_private(dev);
	struct udc_stm32_msg msg;

	while (true) {
		k_msgq_get(&priv->msgq_data, &msg, K_FOREVER);

		/*
		 * Ensure we hold the device lock during processing
		 * to avoid race conditions with API entrypoints.
		 */
		udc_lock_internal(dev, K_FOREVER);

		switch (msg.type) {
		case UDC_STM32_MSG_SETUP:
			/* HAL copies SETUP packet contents to pcd.Setup */
#ifdef CONFIG_STM32_HAL2
			const void *setup = priv->pcd.setup;
#else /* CONFIG_STM32_HAL2 */
			const void *setup = priv->pcd.Setup;
#endif /* CONFIG_STM32_HAL2 */

			udc_setup_received(dev, setup);
			break;
		case UDC_STM32_MSG_DATA_IN:
			handle_msg_data_in(priv, msg.ep);
			break;
		case UDC_STM32_MSG_DATA_OUT:
			handle_msg_data_out(priv, msg.ep, msg.rx_count);
			break;
		}

		udc_unlock_internal(dev);
	}
}

/*
 * NOTE: This will no longer work if a new SoC contains
 * both an instance of the ST USB IP and an instance of
 * of the ST OTGFS or ST OTGHS USB IPs.
 */
#if defined(USB) || defined(USB_DRD_FS)
static inline void udc_stm32_mem_init(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;

	/**
	 * Endpoint configuration table is placed at the
	 * beginning of Private Memory Area and consumes
	 * 8 bytes for each endpoint.
	 */
	priv->occupied_mem = 8 * cfg->num_endpoints;
}

static int udc_stm32_ep_mem_config(const struct device *dev,
				   struct udc_ep_config *ep_cfg,
				   bool enable)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;
	const bool isochronous = ep_cfg->caps.iso;
	uint32_t size;

	/*
	 * Round up request size because the PMA must be accessed
	 * using only word-aligned addresses.
	 */
	size = ROUND_UP(MIN(udc_mps_ep_size(ep_cfg), cfg->ep_mps), 4U);

	if (isochronous) {
		/*
		 * Isochronous EP must be double-buffered.
		 * Allocate two buffers of requested size.
		 */
		size *= 2;
	}

	if (!enable) {
		priv->occupied_mem -= size;
		return 0;
	}

	if (priv->occupied_mem + size >= cfg->dram_size) {
		LOG_ERR("Unable to allocate FIFO for 0x%02x", ep_cfg->addr);
		return -ENOMEM;
	}

	/* Configure PMA offset for the endpoint */
	uint32_t buftype, bufs;

	if (isochronous) {
		/*
		 * hal_udc_pma_config() `pmaaddress` parameter takes two 16-bit
		 * PMA addresses in the high/low 16 bits of fourth u32 parameter
		 */
		const uint16_t buf1_pma_addr = priv->occupied_mem;
		const uint16_t buf2_pma_addr = priv->occupied_mem + (size / 2);

		buftype = STM32_PCD_DBL_BUF;
		bufs = ((uint32_t)buf2_pma_addr << 16) | buf1_pma_addr;
	} else {
		buftype = STM32_PCD_SNG_BUF;
		bufs = priv->occupied_mem;
	}

	if (hal_udc_pma_config(&priv->pcd, ep_cfg->addr, buftype, bufs) != HAL_OK) {
		return -EIO;
	}

	priv->occupied_mem += size;

	return 0;
}
#else
static void udc_stm32_mem_init(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;
	uint32_t rxfifo_size; /* in words */
	stm32_status_t __maybe_unused status;

	LOG_DBG("DRAM size: %uB", cfg->dram_size);

	/*
	 * In addition to the user-provided baseline, RxFIFO should fit:
	 *	- Global OUT NAK (1 word)
	 *	- Received packet information (1 word)
	 *	- Transfer complete status information (2 words per OUT endpoint)
	 *
	 * Align user-provided baseline up to 32-bit word size then
	 * add this "fixed" overhead to obtain the final RxFIFO size.
	 */
	rxfifo_size = DIV_ROUND_UP(CONFIG_UDC_STM32_OTG_RXFIFO_BASELINE_SIZE, 4U);
	rxfifo_size += 2U; /* Global OUT NAK and Rx packet info */
	rxfifo_size += 2U * cfg->num_endpoints;

	LOG_DBG("RxFIFO size: %uB", rxfifo_size * 4U);

	status = HAL_PCDEx_SetRxFiFo(&priv->pcd, rxfifo_size);
	__ASSERT_NO_MSG(status == HAL_OK);

	priv->occupied_mem = rxfifo_size * 4U;

	/* For EP0 TX, reserve only one MPS */
	status = HAL_PCDEx_SetTxFiFo(&priv->pcd, 0,
				     DIV_ROUND_UP(UDC_STM32_EP0_MAX_PACKET_SIZE, 4U));
	__ASSERT_NO_MSG(status == HAL_OK);

	priv->occupied_mem += UDC_STM32_EP0_MAX_PACKET_SIZE;

	/* Reset TX allocs */
	for (unsigned int i = 1U; i < cfg->num_endpoints; i++) {
		status = HAL_PCDEx_SetTxFiFo(&priv->pcd, i, 0);
		__ASSERT_NO_MSG(status == HAL_OK);
	}
}

static int udc_stm32_ep_mem_config(const struct device *dev,
				   struct udc_ep_config *ep_cfg,
				   bool enable)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;
	unsigned int words;

