zephyrproject-rtos/zephyr/drivers/usb/udc/udc_stm32.c
	if (!USB_EP_DIR_IS_IN(ep_cfg->addr) || USB_EP_GET_IDX(ep_cfg->addr) == 0U) {
		return 0;
	}

	words = DIV_ROUND_UP(MIN(udc_mps_ep_size(ep_cfg), cfg->ep_mps), 4U);
	words = (words <= 64) ? words * 2 : words;

	if (!enable) {
		if (priv->occupied_mem >= (words * 4)) {
			priv->occupied_mem -= (words * 4);
		}
		if (HAL_PCDEx_SetTxFiFo(&priv->pcd, USB_EP_GET_IDX(ep_cfg->addr), 0) != HAL_OK) {
			return -EIO;
		}
		return 0;
	}

	if (cfg->dram_size - priv->occupied_mem < words * 4) {
		LOG_ERR("Unable to allocate FIFO for 0x%02x", ep_cfg->addr);
		return -ENOMEM;
	}

	if (HAL_PCDEx_SetTxFiFo(&priv->pcd, USB_EP_GET_IDX(ep_cfg->addr), words) != HAL_OK) {
		return -EIO;
	}

	priv->occupied_mem += words * 4;

	return 0;
}
#endif

/* Initializes ep_cfg->addr and ep_cfg->caps (except caps.mps) */
static void udc_stm32_init_ep_addr_caps(struct udc_ep_config *ep_cfg, uint8_t ep_addr)
{
	const uint8_t ep_idx = USB_EP_GET_IDX(ep_addr);
	const uint8_t dir = USB_EP_GET_DIR(ep_addr);

	ep_cfg->addr = ep_addr;

	if (dir == USB_EP_DIR_OUT) {
		ep_cfg->caps.out = 1;
	} else {
		ep_cfg->caps.in = 1;
	}

	if (ep_idx == 0u) {
		ep_cfg->caps.control = 1;
	} else {
#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32_usb)
		/* OTG IP: non-control endpoints can be used in any mode */
		ep_cfg->caps.bulk = 1;
		ep_cfg->caps.interrupt = 1;
		ep_cfg->caps.iso = 1;
#else /* !DT_HAS_COMPAT_STATUS_OKAY(st_stm32_usb) */
		/*
		 * ST USB IP non-control endpoints allocation:
		 *  - first ISO_OUT_EP_NUM accept isochronous OUT only
		 *  - next ISO_IN_EP_NUM accept isochronous IN
		 *  - all others accept bulk/interrupt in any direction
		 */
		const uint32_t num_iso_out = CONFIG_UDC_STM32_STUSB_ISO_OUT_EP_NUM;
		const uint32_t num_iso_in = CONFIG_UDC_STM32_STUSB_ISO_IN_EP_NUM;

		if (ep_idx <= num_iso_out) {
			/* First M endpoints: ISO OUT only */
			ep_cfg->caps.iso = (dir == USB_EP_DIR_OUT) ? 1 : 0;
		} else if (ep_idx <= (num_iso_out + num_iso_in)) {
			/* Next N endpoints: ISO IN only */
			ep_cfg->caps.iso = (dir == USB_EP_DIR_IN) ? 1 : 0;
		} else {
			/* Remaining endpoints: bulk/interrupt mode */
			ep_cfg->caps.bulk = 1;
			ep_cfg->caps.interrupt = 1;
		}
#endif /* !DT_HAS_COMPAT_STATUS_OKAY(st_stm32_usb) */
	}
}

static void udc_stm32_lock(const struct device *dev)
{
	udc_lock_internal(dev, K_FOREVER);
}

static void udc_stm32_unlock(const struct device *dev)
{
	udc_unlock_internal(dev);
}

int udc_stm32_init(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;
	stm32_status_t status;
	int err;

	err = stm32_usb_pwr_enable();
	if (err != 0) {
		LOG_ERR("Error enabling USB power: %d", err);
		return err;
	}

	if (udc_stm32_clock_enable(dev) < 0) {
		LOG_ERR("Error enabling clock(s)");
		return -EIO;
	}

	/* Wipe and (re)initialize HAL context */
	memset(&priv->pcd, 0, sizeof(priv->pcd));

#ifdef CONFIG_STM32_HAL2
	hal_pcd_config_t pcd_cfg;

	priv->pcd.instance = (hal_pcd_t)cfg->base;
	priv->pcd.endpoints_nbr = cfg->num_endpoints;
	status = HAL_PCD_Init(&priv->pcd, priv->pcd.instance);
	if (status != HAL_OK) {
		LOG_ERR("PCD_Init failed, %d", (int)status);
		return -EIO;
	}

	pcd_cfg.pcd_speed = cfg->selected_speed;
	pcd_cfg.phy_interface = cfg->selected_phy;
	pcd_cfg.sof_enable = IS_ENABLED(CONFIG_UDC_ENABLE_SOF);
	status = HAL_PCD_SetConfig(&priv->pcd, &pcd_cfg);
	if (status != HAL_OK) {
		LOG_ERR("PCD Config failed, %d", (int)status);
		return -EIO;
	}
#else /* CONFIG_STM32_HAL2 */
	priv->pcd.Instance = cfg->base;
	priv->pcd.Init.dev_endpoints = cfg->num_endpoints;
	priv->pcd.Init.ep0_mps = UDC_STM32_EP0_MAX_PACKET_SIZE;
	priv->pcd.Init.phy_itface = cfg->selected_phy;
	priv->pcd.Init.speed = cfg->selected_speed;
	priv->pcd.Init.Sof_enable = IS_ENABLED(CONFIG_UDC_ENABLE_SOF);

	status = HAL_PCD_Init(&priv->pcd);
	if (status != HAL_OK) {
		LOG_ERR("PCD_Init failed, %d", (int)status);
		return -EIO;
	}
#endif /* CONFIG_STM32_HAL2 */

	if (HAL_PCD_Stop(&priv->pcd) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static int udc_stm32_enable(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;
	stm32_status_t status;
	int ret;

	LOG_DBG("Enable UDC");

	udc_stm32_mem_init(dev);

	status = HAL_PCD_Start(&priv->pcd);
	if (status != HAL_OK) {
		LOG_ERR("PCD_Start failed, %d", (int)status);
		return -EIO;
	}

	ret = udc_ep_enable_internal(dev, USB_CONTROL_EP_OUT,
				     USB_EP_TYPE_CONTROL,
				     UDC_STM32_EP0_MAX_PACKET_SIZE, 0);
	if (ret != 0) {
		LOG_ERR("Failed enabling ep 0x%02x", USB_CONTROL_EP_OUT);
		return ret;
	}

	ret = udc_ep_enable_internal(dev, USB_CONTROL_EP_IN,
				     USB_EP_TYPE_CONTROL,
				     UDC_STM32_EP0_MAX_PACKET_SIZE, 0);
	if (ret != 0) {
		LOG_ERR("Failed enabling ep 0x%02x", USB_CONTROL_EP_IN);
		return ret;
	}

	irq_enable(cfg->irqn);

	return 0;
}

static int udc_stm32_disable(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;
	stm32_status_t status;

	irq_disable(cfg->irqn);

	if (udc_ep_disable_internal(dev, USB_CONTROL_EP_OUT) != 0) {
		LOG_ERR("Failed to disable control endpoint");
		return -EIO;
	}

	if (udc_ep_disable_internal(dev, USB_CONTROL_EP_IN) != 0) {
		LOG_ERR("Failed to disable control endpoint");
		return -EIO;
	}

	status = HAL_PCD_Stop(&priv->pcd);
	if (status != HAL_OK) {
		LOG_ERR("PCD_Stop failed, %d", (int)status);
		return -EIO;
	}

	return 0;
}

static int udc_stm32_shutdown(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;
	int err;

#ifdef CONFIG_STM32_HAL2
	HAL_PCD_DeInit(&priv->pcd);
#else /* CONFIG_STM32_HAL2 */
	stm32_status_t status = HAL_PCD_DeInit(&priv->pcd);
	if (status != HAL_OK) {
		LOG_ERR("PCD_DeInit failed, %d", (int)status);
		/* continue anyway */
	}
#endif /* CONFIG_STM32_HAL2 */

	if (udc_stm32_clock_disable(dev) < 0) {
		LOG_ERR("Error disabling clock(s)");
		/* continue anyway */
	}

	err = stm32_usb_pwr_disable();
	if (err != 0) {
		LOG_ERR("Error disabling USB power: %d", err);
		/* continue anyway */
	}

	if (irq_is_enabled(cfg->irqn)) {
		irq_disable(cfg->irqn);
	}

