zephyrproject-rtos/zephyr/drivers/usb/udc/udc_stm32.c
	return 0;
}

static int udc_stm32_set_address(const struct device *dev, const uint8_t addr)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	stm32_status_t status;

	LOG_DBG("Set Address %u", addr);

	status = hal_udc_set_device_address(&priv->pcd, addr);
	if (status != HAL_OK) {
		LOG_ERR("hal_udc_set_device_address failed(0x%02x), %d",
			addr, (int)status);
		return -EIO;
	}

	return 0;
}

static int udc_stm32_host_wakeup(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	stm32_status_t status;

	status = hal_udc_remote_wakeup_start(&priv->pcd);
	if (status != HAL_OK) {
		LOG_ERR("hal_udc_remote_wakeup_start, %d", (int)status);
		return -EIO;
	}

	/* Must be active from 1ms to 15ms as per reference manual. */
	k_sleep(K_MSEC(2));

	status = hal_udc_remote_wakeup_stop(&priv->pcd);
	if (status != HAL_OK) {
		return -EIO;
	}

	udc_set_suspended(dev, false);
	udc_submit_event(dev, UDC_EVT_RESUME, 0);

	return 0;
}

static int udc_stm32_ep_enable(const struct device *dev,
			       struct udc_ep_config *ep_cfg)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	stm32_status_t status;
	uint8_t ep_type;
	int ret;

	LOG_DBG("Enable ep 0x%02x", ep_cfg->addr);

	switch (ep_cfg->attributes & USB_EP_TRANSFER_TYPE_MASK) {
	case USB_EP_TYPE_CONTROL:
		ep_type = STM32_PCD_EP_TYPE_CTRL;
		break;
	case USB_EP_TYPE_BULK:
		ep_type = STM32_PCD_EP_TYPE_BULK;
		break;
	case USB_EP_TYPE_INTERRUPT:
		ep_type = STM32_PCD_EP_TYPE_INTR;
		break;
	case USB_EP_TYPE_ISO:
		ep_type = STM32_PCD_EP_TYPE_ISOC;
		break;
	default:
		return -EINVAL;
	}

	ret = udc_stm32_ep_mem_config(dev, ep_cfg, true);
	if (ret != 0) {
		return ret;
	}

	status = hal_udc_open_endpoint(&priv->pcd, ep_cfg->addr,
				       udc_mps_ep_size(ep_cfg), ep_type);
	if (status != HAL_OK) {
		LOG_ERR("hal_udc_open_endpoint failed(0x%02x), %d",
			ep_cfg->addr, (int)status);
		return -EIO;
	}

	return 0;
}

static int udc_stm32_ep_disable(const struct device *dev,
			      struct udc_ep_config *ep_cfg)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	stm32_status_t status;

	LOG_DBG("Disable ep 0x%02x", ep_cfg->addr);

	status = hal_udc_close_endpoint(&priv->pcd, ep_cfg->addr);
	if (status != HAL_OK) {
		LOG_ERR("hal_udc_close_endpoint failed(0x%02x), %d",
			ep_cfg->addr, (int)status);
		return -EIO;
	}

	return udc_stm32_ep_mem_config(dev, ep_cfg, false);
}

static int udc_stm32_ep_set_halt(const struct device *dev,
				 struct udc_ep_config *ep_cfg)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	stm32_status_t status;

	LOG_DBG("Halt ep 0x%02x", ep_cfg->addr);

	status = hal_udc_set_endpoint_stall(&priv->pcd, ep_cfg->addr);
	if (status != HAL_OK) {
		LOG_ERR("hal_udc_set_endpoint_stall failed(0x%02x), %d",
			ep_cfg->addr, (int)status);
		return -EIO;
	}

	/* Mark endpoint as halted if not control EP */
	if (USB_EP_GET_IDX(ep_cfg->addr) != 0U) {
		ep_cfg->stat.halted = true;
	}

	return 0;
}

static int udc_stm32_ep_clear_halt(const struct device *dev,
				   struct udc_ep_config *ep_cfg)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	stm32_status_t status;
	struct net_buf *buf;
	int ret = 0;

	LOG_DBG("Clear halt for ep 0x%02x", ep_cfg->addr);

	status = hal_udc_clear_endpoint_stall(&priv->pcd, ep_cfg->addr);
	if (status != HAL_OK) {
		LOG_ERR("hal_udc_clear_endpoint_stall failed(0x%02x), %d",
			ep_cfg->addr, (int)status);
		return -EIO;
	}

	/* Clear halt bit from endpoint status */
	ep_cfg->stat.halted = false;

	/* Check if there are transfers queued for EP */
	buf = udc_buf_peek(ep_cfg);
	if (buf != NULL) {
		/*
		 * There is at least one transfer pending.
		 * IN EP transfer can be started only if not busy;
		 * OUT EP transfer should be prepared only if busy.
		 */
		const bool busy = udc_ep_is_busy(ep_cfg);

		if (USB_EP_DIR_IS_IN(ep_cfg->addr) && !busy) {
			udc_stm32_tx(dev, ep_cfg, buf);
		} else if (USB_EP_DIR_IS_OUT(ep_cfg->addr) && !busy) {
			ret = udc_stm32_initiate_ep_rx(dev, ep_cfg, buf);
		}
	}

	return ret;
}

static int udc_stm32_ep_enqueue(const struct device *dev,
				struct udc_ep_config *ep_cfg,
				struct net_buf *buf)
{
	unsigned int lock_key;
	int ret = 0;

	lock_key = irq_lock();

	udc_buf_put(ep_cfg, buf);

	if (USB_EP_DIR_IS_IN(ep_cfg->addr)) {
		if (ep_cfg->stat.halted) {
			LOG_DBG("skip enqueue for halted ep 0x%02x", ep_cfg->addr);
		} else {
			ret = udc_stm32_tx(dev, ep_cfg, buf);
		}
	} else {
		if (!udc_ep_is_busy(ep_cfg)) {
			ret = udc_stm32_initiate_ep_rx(dev, ep_cfg, buf);
		}
	}

	irq_unlock(lock_key);

	return ret;
}

static int udc_stm32_ep_dequeue(const struct device *dev,
				struct udc_ep_config *ep_cfg)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	__maybe_unused stm32_status_t status;

	LOG_DBG("Flush ep 0x%02x", ep_cfg->addr);

	status = hal_udc_flush_endpoint(&priv->pcd, ep_cfg->addr);
	__ASSERT_NO_MSG(status == HAL_OK);

	udc_ep_cancel_queued(dev, ep_cfg);

	udc_ep_set_busy(ep_cfg, false);

	return 0;
}

static enum udc_bus_speed udc_stm32_device_speed(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);

#ifdef CONFIG_STM32_HAL2
	hal_pcd_device_speed_t speed = HAL_PCD_GetDeviceSpeed(&priv->pcd);

	if (speed == HAL_PCD_DEVICE_SPEED_HS) {
		return UDC_BUS_SPEED_HS;
	}

	if (speed == HAL_PCD_DEVICE_SPEED_FS) {
		return UDC_BUS_SPEED_FS;
	}
#else /* CONFIG_STM32_HAL2 */
	/*
	 * N.B.: pcd.Init.speed is used here on purpose instead
	 * of udc_stm32_config::selected_speed because HAL updates
	 * this field after USB enumeration to reflect actual bus speed.
	 */

	if (priv->pcd.Init.speed == PCD_SPEED_HIGH) {
		return UDC_BUS_SPEED_HS;
	}

	if (priv->pcd.Init.speed == PCD_SPEED_HIGH_IN_FULL ||
	    priv->pcd.Init.speed == STM32_PCD_SPEED_FS) {
		return UDC_BUS_SPEED_FS;
	}
#endif /* CONFIG_STM32_HAL2 */

	return UDC_BUS_UNKNOWN;
}

static const struct udc_api udc_stm32_api = {
	.lock = udc_stm32_lock,
	.unlock = udc_stm32_unlock,
	.init = udc_stm32_init,
	.enable = udc_stm32_enable,
	.disable = udc_stm32_disable,
	.shutdown = udc_stm32_shutdown,
	.set_address = udc_stm32_set_address,
	.host_wakeup = udc_stm32_host_wakeup,
	.ep_try_config = NULL,
	.ep_enable = udc_stm32_ep_enable,
	.ep_disable = udc_stm32_ep_disable,
	.ep_set_halt = udc_stm32_ep_set_halt,
	.ep_clear_halt = udc_stm32_ep_clear_halt,
	.ep_enqueue = udc_stm32_ep_enqueue,
	.ep_dequeue = udc_stm32_ep_dequeue,
	.device_speed = udc_stm32_device_speed,
};

static int udc_stm32_driver_preinit(const struct device *dev)
{
	struct udc_stm32_data *priv = udc_get_private(dev);
	const struct udc_stm32_config *cfg = dev->config;
	struct udc_data *data = dev->data;
	int err;

	for (unsigned int i = 0; i < cfg->num_endpoints; i++) {
		udc_stm32_init_ep_addr_caps(cfg->out_eps + i, USB_EP_DIR_OUT | i);
		if (i == 0) {
			cfg->out_eps[i].caps.mps = UDC_STM32_EP0_MAX_PACKET_SIZE;
		} else {
			cfg->out_eps[i].caps.mps = cfg->ep_mps;
		}

		err = udc_register_ep(dev, cfg->out_eps + i);
		if (err != 0) {
			LOG_ERR("Failed to register endpoint");
			return err;
		}
	}

	for (unsigned int i = 0; i < cfg->num_endpoints; i++) {
		udc_stm32_init_ep_addr_caps(cfg->in_eps + i, USB_EP_DIR_IN | i);
		if (i == 0) {
			cfg->in_eps[i].caps.mps = UDC_STM32_EP0_MAX_PACKET_SIZE;
		} else {
			cfg->in_eps[i].caps.mps = cfg->ep_mps;
		}

