zephyrproject-rtos/zephyr/drivers/usb/udc/udc_stm32.c
		err = udc_register_ep(dev, cfg->in_eps + i);
		if (err != 0) {
			LOG_ERR("Failed to register endpoint");
			return err;
		}
	}

	data->caps.rwup = true;
	data->caps.addr_before_status = true;
	data->caps.mps0 = UDC_MPS0_64;
	if (cfg->selected_speed == PCD_SPEED_HIGH) {
		data->caps.hs = true;
	}

	priv->dev = dev;

	k_msgq_init(&priv->msgq_data, priv->msgq_buf, sizeof(struct udc_stm32_msg),
		    CONFIG_UDC_STM32_MAX_QMESSAGES);

	k_thread_create(&priv->thread_data, cfg->thread_stack,
			cfg->thread_stack_size, udc_stm32_thread_handler,
			(void *)dev, NULL, NULL, K_PRIO_COOP(CONFIG_UDC_STM32_THREAD_PRIORITY),
			K_ESSENTIAL, K_NO_WAIT);
	k_thread_name_set(&priv->thread_data, dev->name);

	/*
	 * Note that this really only configures the interrupt priority;
	 * IRQn-to-ISR mapping is done at build time by IRQ_CONNECT().
	 */
	cfg->irq_connect();

	err = pinctrl_apply_state(cfg->pinctrl, PINCTRL_STATE_DEFAULT);

	/* Ignore -ENOENT returned on series without pinctrl */
	if (err < 0 && err != -ENOENT) {
		LOG_ERR("USB pinctrl setup failed (%d)", err);
		return err;
	}

#ifdef SYSCFG_CFGR1_USB_IT_RMP
	/*
	 * STM32F302/F303: USB IRQ collides with CAN_1 IRQ (§14.1.3, RM0316)
	 * Remap IRQ by default to enable use of both IPs simultaneoulsy
	 * This should be done before calling any HAL function
	 */
	if (LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_SYSCFG)) {
		LL_SYSCFG_EnableRemapIT_USB();
	} else {
		LOG_ERR("System Configuration Controller clock is "
			"disabled. Unable to enable IRQ remapping.");
	}
#endif

	if (cfg->ulpi_reset_gpio.port != NULL) {
		if (!gpio_is_ready_dt(&cfg->ulpi_reset_gpio)) {
			LOG_ERR("Reset GPIO device not ready");
			return -EINVAL;
		}
		if (gpio_pin_configure_dt(&cfg->ulpi_reset_gpio, GPIO_OUTPUT_INACTIVE) != 0) {
			LOG_ERR("Couldn't configure reset pin");
			return -EIO;
		}
	}

	return 0;
}

/*
 * Note the usage of device ordinals to create per-instance symbol
 * names, whereas most other STM32 drivers use the "instance number"
 * for this purpose instead. Unlike most drivers, we can instantiate
 * devices with different compatibles *in a single build* such as on
 * SoCs with one OTGHS + one OTGFS. The instance number is unique only
 * for *one* given compatible so it cannot be used here because there
 * are multiple compatibles. Device ordinals are globally unique and
 * look similar to instance numbers so they fit nice as replacement.
 */
#define UDC_STM32_DEFINE(node_id, phy_node, ord, _irq_name)					\
	K_THREAD_STACK_DEFINE(CONCAT(udc, ord, _thr_stk), CONFIG_UDC_STM32_STACK_SIZE);		\
												\
	static struct udc_ep_config CONCAT(udc, ord, _in_ep_cfg)				\
		[DT_PROP(node_id, num_bidir_endpoints)];					\
	static struct udc_ep_config CONCAT(udc, ord, _out_ep_cfg)				\
		[DT_PROP(node_id, num_bidir_endpoints)];					\
												\
	static struct udc_stm32_data CONCAT(udc, ord, _priv);					\
												\
	static struct udc_data CONCAT(udc, ord, _data) = {					\
		.mutex = Z_MUTEX_INITIALIZER(CONCAT(udc, ord, _data).mutex),			\
		.priv = &CONCAT(udc, ord, _priv),						\
	};											\
												\
	static void CONCAT(udc, ord, _irq_connect)(void) {					\
		IRQ_CONNECT(									\
			DT_IRQ_BY_NAME(node_id, _irq_name, irq),				\
			DT_IRQ_BY_NAME(node_id, _irq_name, priority),				\
			HAL_PCD_IRQHandler, &CONCAT(udc, ord, _priv).pcd, 0);			\
	}											\
												\
	PINCTRL_DT_DEFINE(node_id);								\
												\
	static const struct stm32_pclken CONCAT(udc, ord, _pclken)[] =				\
		STM32_DT_CLOCKS(node_id);							\
												\
	static const struct udc_stm32_config CONCAT(udc, ord, _cfg) = {				\
		.base = (void *)DT_REG_ADDR(node_id),						\
		.num_endpoints = DT_PROP(node_id, num_bidir_endpoints),				\
		.dram_size = DT_PROP(node_id, ram_size),					\
		.irq_connect = &CONCAT(udc, ord, _irq_connect),					\
		.irqn = DT_IRQ_BY_NAME(node_id, _irq_name, irq),				\
		.pclken = (struct stm32_pclken *)&CONCAT(udc, ord, _pclken),			\
		.num_clocks = DT_NUM_CLOCKS(node_id),						\
		.pinctrl = PINCTRL_DT_DEV_CONFIG_GET(node_id),					\
		.phy = USB_STM32_PHY_PSEUDODEV_GET_OR_NULL(node_id),				\
		.in_eps = CONCAT(udc, ord, _in_ep_cfg),						\
		.out_eps = CONCAT(udc, ord, _out_ep_cfg),					\
		.ep_mps = UDC_STM32_NODE_EP_MPS(node_id),					\
		.selected_phy = UDC_STM32_NODE_PHY_ITFACE(node_id),				\
		.selected_speed = UDC_STM32_NODE_SPEED(node_id),				\
		.thread_stack = CONCAT(udc, ord, _thr_stk),					\
		.thread_stack_size = K_THREAD_STACK_SIZEOF(CONCAT(udc, ord, _thr_stk)),		\
		.disconnect_gpio = GPIO_DT_SPEC_GET_OR(node_id, disconnect_gpios, {0}),		\
		.ulpi_reset_gpio = GPIO_DT_SPEC_GET_OR(phy_node, reset_gpios, {0}),		\
	};											\
												\
	DEVICE_DT_DEFINE(node_id, udc_stm32_driver_preinit, NULL, &CONCAT(udc, ord, _data),	\
		&CONCAT(udc, ord, _cfg), POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEVICE,	\
		&udc_stm32_api);

#define UDC_STM32_FOREACH_DEFINE(node_id, _irq_name)						\
	UDC_STM32_DEFINE(node_id, USB_STM32_PHY(node_id), DT_DEP_ORD(node_id), _irq_name)

/* Third argument = name of global IRQ */
DT_FOREACH_STATUS_OKAY_VARGS(st_stm32_otghs, UDC_STM32_FOREACH_DEFINE, otghs)
DT_FOREACH_STATUS_OKAY_VARGS(st_stm32_otgfs, UDC_STM32_FOREACH_DEFINE, otgfs)
DT_FOREACH_STATUS_OKAY_VARGS(st_stm32_usb, UDC_STM32_FOREACH_DEFINE, usb)
